# DetailLevel Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Options..::..DetailLevel Property
Options Class See Also
---
The detail level for the geometry extracted with these options.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ViewDetailLevel DetailLevel { get; set; }
```

Visual Basic
---
```text
Public Property DetailLevel As ViewDetailLevel
	Get
	Set
```

Visual C++
---
```text
public:
property ViewDetailLevel DetailLevel {
	ViewDetailLevel get ();
	void set (ViewDetailLevel value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Thrown when setting this property, if View is already set. When View is set the detail level of the view is used. |

# See Also
Options Class
Autodesk.Revit.DB Namespace